# frozen_string_literal: true

# This file should contain all the record creation needed to seed the database with its default values.
# The data can then be loaded with the bin/rails db:seed command (or created alongside the database with db:setup).
#
# Examples:
#
#   movies = Movie.create([{ name: 'Star Wars' }, { name: 'Lord of the Rings' }])
#   Character.create(name: 'Luke', movie: movies.first)

User.create(username: 'user1', password: 'password')
User.create(username: 'user2', password: 'password')
User.create(username: 'admin', password: 'password', admin: true)
User.create(username: 'admin2', password: 'password', admin: true)
admin_user = User.last
admin_user.items.create!(make: "Мінімийка високого тиску Karcher" , model: "K 3 Car & Home",
                                   price: 120, desc: "Мінімийка високого тиску K3 Car&Home легко справляється з будь-якими забрудненнями.
 Оснащена 6-метровим шлангом високого тиску, вона прекрасно підходить для періодичного прибирання навколо будинку і в саду, наприклад для
 очищення садових меблів, терас, доріжок і майданчиків, а також для миття автомобілів. Комплект для миття автомобіля та
 прибирання навколо будинку (Car&Home) містить мийну щітку для видалення з кузова нальоту бруду, насадку для пінного чищення,
 яка формує стійку піну з потужним очищувальним ефектом, автомобільний шампунь (500 мл), пристосування для очищення поверхонь
 T1 та мийний засіб Patio&Deck (500 мл). Струменева трубка Vario Power дає змогу легко регулювати тиск залежно від виду поверхні, що очищається
. Фреза для бруду, що формує обертовий точковий струмінь, видаляє навіть стійкі забруднення. Насос захищений фільтром для
 води, що подається на вхід, гарантує довгий термін його служби. Завдяки колесам апарат можна легко переміщати до різних місць застосування.",
                                    image_url: "https://i.moyo.ua/img/products/5759/52_600.jpg")
admin_user.items.create!(make: "Господарський пилосос Karcher" , model: "WD 6 P S",
                         price: 120, desc: "Господарський пилосос WD 6 PS V-30/6/22/T має колосальну силу всмоктування,
споживаючи при цьому всього лише 1300 Вт. Апарат оснащено 6-метровим кабелем, всмоктувальним шлангом довжиною 2,2 м і 30-літровим
 сміттєзбірником з отвором для зливу рідин, що закривається різьбовою пробкою. Вбудована штепсельна розетка з автоматикою увімкнення/вимкнення дозволяє підключати до нього електроінструменти
 (лобзики, шліфувальні машини тощо) для безпосереднього збору пилу, що утворюється під час роботи з ними. При цьому поворотний перемикач забезпечує регулювання сили всмоктування залежно від задачі
, що вирішується. Вийняти плоский складчастий фільтр дуже легко і без контакту з брудом: достатньо лише від'єднати касету з ним. При цьому ефективна вбудована система очищення фільтра, що активується натисканням кнопки, забезпечує відновлення високої сили всмоктування.
 Для очищення важкодоступних місць та предметів, що потребують делікатного поводження, передбачено функцію видування. Знімна рукоятка із захистом від розрядів статичної електрики дозволяє встановлювати насадки безпосередньо на кінці всмоктувального шланга, що особливо
важливо при збиранні дрібного пилу. Ще однією перевагою є можливість компактного зберігання шланга, що підвішується з обох боків у верхній частині пилососа, та закріплення насадки для підлоги разом зі шлангом та подовжувальними трубками на час перерв у роботі.",
                         image_url: "https://s1.kaercher-media.com/mam/16283600/mainproduct/176104/d1.jpg")

